project02/app/controllers/store_controller.rb

INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2011-02-01 02:49:07', 4, 2, 1, 59.9, '2011-02-01 02:49:07')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('Ben Makuh', '1221 hippy st', '2011-02-01 02:49:07', '2011-02-01 02:49:07', 'check', 'alphari')
---
  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save